[Killed] Block removal mutation
Implementation/mutation-testing-implementation/MutationApp/ShoppingCartService.cs:18:38
         public readonly List<CartItem> items;
 
         /* Constructor */
-        public ShoppingCartService() { items = new List<CartItem>(); }
+        public ShoppingCartService() {}
 
         /* Add Item to the list */
killedBy: MutationApp.Test.ShoppingCartServiceTest.CalculateTotalPrice_ShouldReturnCorrectTotalPrice_WhenCartHasItems; MutationApp.Test.ShoppingCartServiceTest.CalculateTotalPrice_ShouldReturnZero_WhenCartIsEmpty; MutationApp.Test.ShoppingCartServiceTest.IsDiscountEligible_ShouldReturnFalse_WhenCartItemsIs2

[Killed] Equality mutation
Implementation/mutation-testing-implementation/MutationApp/ShoppingCartService.cs:27:34
         public void RemoveItem(CartItem item) => items.Remove(item);
 
         /* Check if shopping cart is empty */
-        public bool IsEmpty() => items.Count == 0;
+        public bool IsEmpty() => items.Count != 0;
 
         /* Check if cart is eligible for discount */
killedBy: MutationApp.Test.ShoppingCartServiceTest.IsEmpty_ShouldReturnFalse_WhenCartIsNotEmpty; MutationApp.Test.ShoppingCartServiceTest.IsEmpty_ShouldReturnTrue_WhenCartIsEmpty

[Killed] Equality mutation
Implementation/mutation-testing-implementation/MutationApp/ShoppingCartService.cs:30:45
         public bool IsEmpty() => items.Count == 0;
 
         /* Check if cart is eligible for discount */
-        public bool IsDiscountEligible() => items.Count >= DISCOUNT_THRESHOLD_QUANTITY;   
+        public bool IsDiscountEligible() => items.Count > DISCOUNT_THRESHOLD_QUANTITY;   
 
         /* Calculate and returns the total price without discount */
killedBy: MutationApp.Test.ShoppingCartServiceTest.IsDiscountEligible_ShouldReturnTrue_WhenCartItemsIs5

[Killed] Equality mutation
Implementation/mutation-testing-implementation/MutationApp/ShoppingCartService.cs:30:45
         public bool IsEmpty() => items.Count == 0;
 
         /* Check if cart is eligible for discount */
-        public bool IsDiscountEligible() => items.Count >= DISCOUNT_THRESHOLD_QUANTITY;   
+        public bool IsDiscountEligible() => items.Count < DISCOUNT_THRESHOLD_QUANTITY;   
 
         /* Calculate and returns the total price without discount */
killedBy: MutationApp.Test.ShoppingCartServiceTest.IsDiscountEligible_ShouldReturnFalse_WhenCartItemsIs2; MutationApp.Test.ShoppingCartServiceTest.IsDiscountEligible_ShouldReturnTrue_WhenCartItemsIs5; MutationApp.Test.ShoppingCartServiceTest.IsDiscountEligible_ShouldReturnTrue_WhenCartItemsIs9

[Killed] Arithmetic mutation
Implementation/mutation-testing-implementation/MutationApp/ShoppingCartService.cs:33:85
         public bool IsDiscountEligible() => items.Count >= DISCOUNT_THRESHOLD_QUANTITY;   
 
         /* Calculate and returns the total price without discount */
-        public decimal CalculateTotalPriceWithoutDiscount() => items.Select(item => item.Price * item.Quantity).Sum();
+        public decimal CalculateTotalPriceWithoutDiscount() => items.Select(item => item.Price / item.Quantity).Sum();
     }
 
killedBy: MutationApp.Test.ShoppingCartServiceTest.CalculateTotalPrice_ShouldReturnCorrectTotalPrice_WhenCartHasItems

[Killed] Linq method mutation (Sum() to Max())
Implementation/mutation-testing-implementation/MutationApp/ShoppingCartService.cs:33:64
         public bool IsDiscountEligible() => items.Count >= DISCOUNT_THRESHOLD_QUANTITY;   
 
         /* Calculate and returns the total price without discount */
-        public decimal CalculateTotalPriceWithoutDiscount() => items.Select(item => item.Price * item.Quantity).Sum();
+        public decimal CalculateTotalPriceWithoutDiscount() => items.Select(item => item.Price * item.Quantity).Max();
     }
 
killedBy: MutationApp.Test.ShoppingCartServiceTest.CalculateTotalPrice_ShouldReturnCorrectTotalPrice_WhenCartHasItems; MutationApp.Test.ShoppingCartServiceTest.CalculateTotalPrice_ShouldReturnZero_WhenCartIsEmpty
